Revit.Elements.SpecType.#ctor(System.String)
Init SpecType with typeId of a ForgeTypeId
typeId:

Revit.Elements.SpecType.#ctor(Autodesk.Revit.DB.ForgeTypeId)
Init SpecType with an existing ForgeTypeId
forgeTypeId:

Revit.Elements.SpecType.ByTypeId(System.String)
Get a SpecType by Forge schema identifier.
typeId: a schema identifier
Returns:

Revit.Elements.SpecType.FromExisting(Autodesk.Revit.DB.ForgeTypeId)
Wrap an existing ForgeTypeId to SpecType
forgeTypeId:
Returns: